app/controllers/mahasiswas_controller.rb

SELECT "mahasiswas".* FROM "mahasiswas"
---
  def index
    @mahasiswas = Mahasiswa.all

INSERT INTO "mahasiswas" ("nama", "alamat", "tanggal", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["nama", "Anggi"], ["alamat", "polisi tidur"], ["tanggal", "2016-06-28"], ["created_at", "2018-11-16 15:42:12.101541"], ["updated_at", "2018-11-16 15:42:12.101541"]]
---
  def create
    @mahasiswa = Mahasiswa.new(mahasiswa_params)

    respond_to do |format|
      if @mahasiswa.save

SELECT  "mahasiswas".* FROM "mahasiswas" WHERE "mahasiswas"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
    def set_mahasiswa
      @mahasiswa = Mahasiswa.find(params[:id])